{"post":{"all_awardings":[{"count":1,"name":"Platinum"},{"count":6,"name":"Silver"},{"count":2,"name":"Gold"}],"title":"What is the scariest story you know that is 100% true?","author":"Noahs_25","num_comments":27570,"subreddit":"AskReddit","selftext":"","created_utc":1565699601,"over_18":false,"score":84092},"comments":[[{"author":"[deleted]","body":[{"text":"Was working the evening shift at a gas station. Man comes in all disoriented. I go to help him out.","frame":0},{"text":"he has a gash on his head and doesn't know where he was.","frame":1},{"text":"I couldn't see any crashes around so assumed he had fallen or something.","frame":2},{"text":"Normally we are supposed to stay inside the glass shielded register area whenever anyone is in the store.","frame":3},{"text":"I, being a nice human being, went to help while calling the police/EMS. They got there and checked him out. They thought his head may have been fractured. Took him to the ER. I went back to work.","frame":4},{"text":"Cops stopped back by for some coffee a few hours later.","frame":5},{"text":"They told me the guy got hit by a baseball bat trying to break into a little girl's bedroom and was wanted for rape and murder in two other states. I never left the register area at night again.","frame":6}],"all_awardings":[{"count":1,"name":"Silver"},{"count":1,"name":"Gold"},{"count":1,"name":"Platinum"}],"created_utc":1565710341,"depth":0,"score":51235,"avatar":{"face":"92-face.png","head":"9-head.png","body":"147-body.png"}},{"author":"JPCollectibles","body":[{"text":"Kudos to the slugger that hit him.","frame":7}],"all_awardings":[{"count":1,"name":"Silver"}],"created_utc":1565716009,"depth":1,"score":18380,"avatar":{"face":"70-face.png","head":"31-head.png","body":"112-body.png"}},{"author":"Sassanach36","body":[{"text":"Plot twist: It was the six year old.","frame":8}],"all_awardings":[{"count":1,"name":"Silver"}],"created_utc":1565716508,"depth":2,"score":8277,"avatar":{"face":"89-face.png","head":"94-head.png","body":"102-body.png"}}],[{"author":"Lillipout","body":[{"text":"The Lake Nyos Disaster.","frame":0},{"text":"The lake periodically belches a cloud of invisible carbon dioxide gas that suffocates everything within a 16 mile radius.","frame":1},{"text":"In 1986, over 1700 people and all their livestock died without even understanding what was happening to them.","frame":2}],"all_awardings":[{"count":2,"name":"Silver"}],"created_utc":1565707405,"depth":0,"score":45189,"avatar":{"face":"34-face.png","head":"47-head.png","body":"75-body.png"}},{"author":"snaafuuu","body":[{"text":"My science teacher in high school was in the Peace Corps and one of the first people to come across this village after it happened.","frame":3},{"text":"He said it was so eerie because all the flies and mosquitoes had died and it was so silent.","frame":4}],"all_awardings":[],"created_utc":1565714848,"depth":1,"score":25384,"avatar":{"face":"37-face.png","head":"153-head.png","body":"24-body.png"}},{"author":"SpaceGeneralAmerica","body":[{"text":"&gt; all the flies and mosquitoes had died  <br><br>This scares me far more than the death of the people and livestock.","frame":5},{"text":"Because no matter where you go, you always expect for at least one fly or mosquito to be there. But to find even those things dead... my God.","frame":6}],"all_awardings":[],"created_utc":1565716542,"depth":2,"score":13368,"avatar":{"face":"85-face.png","head":"51-head.png","body":"79-body.png"}}],[{"author":"-spookyxghost-","body":[{"text":"The story of Mary Vincent always stands out to me.","frame":0},{"text":"<br><br>In 1978, 15 year old Mary was hitchhiking. A man named Lawrence Singleton picked her up.","frame":1},{"text":"<br><br>He brutally raped her, and eventually made her get out of the car.","frame":2},{"text":"She planned to run, but he noticed, and cut both her arms off.","frame":3},{"text":"He threw her into a ditch/ravine and left her to die.","frame":4},{"text":"<br><br>She packed her stumps with mud to stop the bleeding and spent all night crawling out.","frame":5},{"text":"<br><br>She eventually makes it to the highway and starts walking, naked and covered in blood. The first car that saw her sped away in fear. The second car was a couple on their honeymoon. They picked her up and she survived.","frame":6},{"text":"<br><br>Edited to add: I was in a rush when I wrote this, so you should definitely read more into the story, it’s crazy.","frame":7},{"text":"From the horrific act itself, to the court proceedings, to the fact that he hardly served any time.","frame":8}],"all_awardings":[{"count":2,"name":"Silver"}],"created_utc":1565713813,"depth":0,"score":38112,"avatar":{"face":"58-face.png","head":"126-head.png","body":"154-body.png"}},{"author":"eleanorlance","body":[{"text":"what really upsets me most about this is that singleton was released from jail for “good behavior” and went on to murder a different woman a few years later, roxanne hayes.","frame":9}],"all_awardings":[],"created_utc":1565719509,"depth":1,"score":21457,"avatar":{"face":"19-face.png","head":"74-head.png","body":"2-body.png"}},{"author":"Florenceismyhomie","body":[{"text":"I think in these scenarios we can safely say that if you can rape someone, chop their fucking arms off and leave them to die, you aren’t ever safe to be released.","frame":10}],"all_awardings":[],"created_utc":1565722563,"depth":2,"score":19427,"avatar":{"face":"53-face.png","head":"79-head.png","body":"70-body.png"}}],[{"author":"mcsmith610","body":[{"text":"John List killed his whole family-wife, mother, daughter and two sons.","frame":0},{"text":"He meticulously planned the whole thing-cancelling all delivery services, excusing the kids from school, and even turned the air conditioning as low as possible to preserve the bodies for as long as possible.","frame":1},{"text":"<br><br>After he killed them all, he placed the bodies in sleeping bags and lined them up.","frame":2},{"text":"He then wrote a letter to his pastor explaining why he had to kill them.","frame":3},{"text":"<br><br>He then leaves and isn’t heard from again.","frame":4},{"text":"<br><br>18 years later he’s remarried and doing the same job as before but this time he doesn’t have any children.","frame":5},{"text":"He’s finally arrested after a tip was given to the FBI.","frame":6},{"text":"<br><br>Crazy thing is that because he planned it so well, the bodies weren’t discovered until a month after the murders so he had a huge head start and essentially started a new life in the same career and was heavily involved in a new church down in Virginia. Took 18 years to capture him.","frame":7}],"all_awardings":[{"count":2,"name":"Gold"}],"created_utc":1565705384,"depth":0,"score":38099,"avatar":{"face":"82-face.png","head":"134-head.png","body":"22-body.png"}},{"author":"tmckey150","body":[{"text":"What did the letter say that he left?","frame":8}],"all_awardings":[],"created_utc":1565708735,"depth":1,"score":13318,"avatar":{"face":"44-face.png","head":"168-head.png","body":"104-body.png"}},{"author":"mcsmith610","body":[{"text":"He pretty much explained that he killed his family to ensure their entry into heaven because he was worried they were straying from their faith.","frame":9},{"text":"So in a way, he thought he was saving their souls.","frame":10}],"all_awardings":[],"created_utc":1565708911,"depth":2,"score":22568,"avatar":{"face":"70-face.png","head":"89-head.png","body":"9-body.png"}}],[{"author":"JimmyL2014","body":[{"text":"One of my friends had someone following her home, hiding in the bushes so they couldn't be seen.","frame":0},{"text":"She booked it to her house, got inside, and he was watching the house from the outside. She called the cops. They come along quietly and got the jump on him. He had condoms, handcuffs, and a knife.","frame":1},{"text":"When they got his DNA, it turned out that he was linked to a half dozen rapes in the area.","frame":2},{"text":"She credits her regimen of running sprints to outrunning him that night and firmly believes she would have been raped if she couldn't outrun him then.","frame":3}],"all_awardings":[],"created_utc":1565701568,"depth":0,"score":35399,"avatar":{"face":"61-face.png","head":"19-head.png","body":"128-body.png"}},{"author":"Quireman","body":[{"text":"Not trying to make light of the story or anything, but he actually had condoms? Never thought of a rapist doing protected sex.","frame":4}],"all_awardings":[],"created_utc":1565703511,"depth":1,"score":4101,"avatar":{"face":"61-face.png","head":"111-head.png","body":"119-body.png"}},{"author":"camerajack21","body":[{"text":"It happens quite a lot I think.","frame":5},{"text":"Very little chance of depositing any DNA and thus less chance of getting caught.","frame":6},{"text":"The same way you'd wear gloves when carrying out a crime if you were even slightly using your brain.","frame":7}],"all_awardings":[],"created_utc":1565703913,"depth":2,"score":5892,"avatar":{"face":"36-face.png","head":"81-head.png","body":"176-body.png"}}],[{"author":"sixesand7s","body":[{"text":"In my town in the early 90's there was a notorious killer that had all of BC, Canada on watch.","frame":0},{"text":"My wifes mother (years and years before I knew them) had been home alone while her Husband was in England doing tree surgeon work (arborist)<br><br>She was in her laundry room when a man walked up from her basement, completely scaring her, she freaked out and said what the hell are you doing here?","frame":1},{"text":"<br><br>He said he was friends with her husband and was just coming to see if he was here, apparently he told him he could just walk in. Which she knew was bullshit.","frame":2},{"text":"<br><br>She was smart enough to tell him that he was just at the store and would be back any minute.","frame":3},{"text":"He said he would wait outside for him, as soon as he left she called the police, but he was long gone by the time they got here.","frame":4},{"text":"<br><br>Two weeks later, the killer was caught, his mugshot put on TV and it was the guy in her house.","frame":5},{"text":"<br><br>&amp;#x200B;<br><br>EDIT: The Guys Name was Terry Driver Heres a link to his Wiki","frame":6}],"all_awardings":[{"count":1,"name":"Gold"}],"created_utc":1565714821,"depth":0,"score":34022,"avatar":{"face":"49-face.png","head":"96-head.png","body":"5-body.png"}},{"author":"FlyingRatSauce","body":[{"text":"My family has a similar story and I’m pretty sure some of you serial killer buffs out there might figure out who it is before the reveal because their story is pretty unique.","frame":7},{"text":"<br><br>When my parents were in college they went on a trip down to Florida.","frame":8},{"text":"They had met through mutual friends and were down there together but hadn’t gone on a date yet.","frame":9},{"text":"My dad and one of his friends were planing to meet my mom and some of her friends at a hotel but being the carefree college guys they were they lost track of time and realized it was impossible to get to the hotel on time by walking.","frame":10},{"text":"<br><br>They decided the best solution to their problem was to hitch hike and a car with two women picked him up.","frame":11},{"text":"<br><br>Everything seemed fine until the driver asked them if it was okay to stop for gas.","frame":12},{"text":"My dad and his friend agreed it was no problem since they were making good time and she drove into a gas station.","frame":13},{"text":"She then pumped her car full of gas before hopping back in and flooring it, basically stealing the gas with two hitch hikers in the back.","frame":14},{"text":"My dad and his friend were beginning to freak out when she pulled a gun from under her seat and asked “are we gonna have a problem” or something like that.","frame":15},{"text":"<br><br>My dad and his friend shook their heads vehemently because what else do you do in that situation.","frame":16},{"text":"<br><br>She then drove them to the hotel and dropped them off without so much as a scratch and they kinda thought nothing of it until the news started reporting on a serial killer in Florida known as Aileen Wuornos.","frame":17},{"text":"He took one look at her picture and instantly recognized her as the driver.","frame":18},{"text":"<br><br>The only reason my dad thinks she didn’t straight up kill them was because they were supper polite and respectful to her and her victims where usually scumbag guys trying to take advantage of her.","frame":19},{"text":"<br><br>Tl;Dr: Aileen Wuornos is the reason my dad got to his first date with mom on time. <br><br>Edit: spelling","frame":20}],"all_awardings":[{"count":1,"name":"Silver"},{"count":1,"name":"Gold"},{"count":1,"name":"Platinum"}],"created_utc":1565725518,"depth":1,"score":11958,"avatar":{"face":"38-face.png","head":"29-head.png","body":"118-body.png"}},{"author":"grusel_cookie","body":[{"text":"Omg this is the craziest how I met your mother story I ever heard","frame":21}],"all_awardings":[],"created_utc":1565726663,"depth":2,"score":5623,"avatar":{"face":"24-face.png","head":"126-head.png","body":"43-body.png"}}],[{"author":"persondude27","body":[{"text":"An acquaintance of mine sent his son to triathlon camp in Texas.","frame":0},{"text":"<br><br>A week later, his son came back from camp.","frame":1},{"text":"The next day, the son was complaining of a headache. Four days later, he was dead.","frame":2},{"text":"Healthy, happy, fit 12 year old one week, dead the next.","frame":3},{"text":"<br><br>Turns out the lake had Naegleria fowleri, the brain-eating amoeba.","frame":4},{"text":"Nothing scares me as irrationally as already being dead and waiting for your body to catch on. <br><br>Link for those interested.","frame":5}],"all_awardings":[{"count":1,"name":"Silver"}],"created_utc":1565707583,"depth":0,"score":32397,"avatar":{"face":"92-face.png","head":"76-head.png","body":"115-body.png"}},{"author":"surpriseDRE","body":[{"text":"Naegleria is terrifying to me!","frame":6},{"text":"You can get it just from getting water up your nose swimming in a lake or (I’ve heard but am too lazy to check) there have been people who got it from using a Neti Pot","frame":7}],"all_awardings":[],"created_utc":1565714062,"depth":1,"score":9317,"avatar":{"face":"42-face.png","head":"103-head.png","body":"96-body.png"}},{"author":"persondude27","body":[{"text":"Yep, the amoeba needs to come into contact with the top of your nose, so you have to snort the water.","frame":8},{"text":"Or, if you happened to live in Louisiana in 2013, they weren't using enough chorline in the water supply, so people using neti-pots with tap water were exposed.","frame":9},{"text":"<br><br>The good news is that the brain-eaters really like specific conditions - they like very warm (80F+), stangnant water with zero salt or chlorine.","frame":10},{"text":"So even a little bit of chlorine or bromine is enough to protect yourself.","frame":11},{"text":"In the US, only lakes in the South (Texas, Louisiana, Florida, Georgia, etc) meet those conditions, and humans don't want to spend a lot of time in that water since it's usually pretty gross.","frame":12},{"text":"Even then, you still have to get the water up your nose (water skiing or jetskiing are the two common causes). (edit, also cases in MN and AZ).","frame":13},{"text":"<br><br>Interestingly, there was a guy here who did an AMA about a treatment.","frame":14},{"text":"You just have to move quickly, because once a person loses their sense of smell, it's already over (because the amoebae have eaten your olfactory bulb, the part of your brain responsible for smelling.","frame":15},{"text":"Then it continues eating, and eventually ends up at your brainstem, which controls things like breathing and heart rate).","frame":16}],"all_awardings":[],"created_utc":1565714611,"depth":2,"score":8912,"avatar":{"face":"33-face.png","head":"141-head.png","body":"22-body.png"}}],[{"author":"Tsquare43","body":[{"text":"3 sailors survived the sinking of the USS *West Virgina* at Pearl Harbor, only to die 16 days later, due to the lack of air.","frame":0},{"text":"The Navy knew they were there, but couldn't get to them. <br><br>16 days to die","frame":1}],"all_awardings":[],"created_utc":1565701943,"depth":0,"score":29282,"avatar":{"face":"34-face.png","head":"8-head.png","body":"91-body.png"}},{"author":"RestartingMyLife0918","body":[{"text":"Harrison Okene 2013 Nigerian boat sinking.","frame":2},{"text":"Was trapped in the boat for 3 days at the bottom of the ocean.","frame":3},{"text":"<br><br> interview  rescue video  5:30 the diver finds the area Harrison is in. See's a hand a few feet from his face and reaches out to grab it. Only then did they realize the person was alive.","frame":4},{"text":"30 seconds later the diver enters the air pocket Harrison has been surviving in.","frame":5}],"all_awardings":[],"created_utc":1565716239,"depth":1,"score":8168,"avatar":{"face":"65-face.png","head":"159-head.png","body":"174-body.png"}},{"author":"throwaway_thyroid","body":[{"text":"Wow. What a moment for everyone involved.","frame":6},{"text":"I can't imagine three days, and then suddenly a person appears.","frame":7}],"all_awardings":[],"created_utc":1565718562,"depth":2,"score":4216,"avatar":{"face":"65-face.png","head":"45-head.png","body":"49-body.png"}}]]}