{
  "post": {
    "all_awardings": [
      {
        "count": 1,
        "name": "Silver"
      },
      {
        "count": 2,
        "name": "Helpful"
      },
      {
        "count": 3,
        "name": "Wholesome"
      }
    ],
    "id": "tniyud",
    "title": "What's the most out of touch thing you've heard a person say?",
    "author": "LaunchesKayaks",
    "num_comments": 5873,
    "permalink": "/r/AskReddit/comments/tniyud/whats_the_most_out_of_touch_thing_youve_heard_a/",
    "score": 8024,
    "subreddit": "AskReddit",
    "subreddit_name_prefixed": "r/AskReddit",
    "total_awards_received": 6,
    "ups": 8024,
    "selftext": ""
  },
  "comments": [
    {
      "content": "When my  best friend passed unexpectedly, a lot of people said \"well at least it wasn't one of your female friends. That would have been way harder.\" As though I can't have a strong platonic bond with someone of the opposite sex.\n\nEdited to add because people are asking: It may have been a stretch to say \"a lot\" and I own that. I can think of 11 people who said it to me, but I'm saying 6-11 because if you take my coworkers and bosses who said it out of the equation, it was 6 people. I gave my coworkers and bosses the benefit of the doubt as I'm in the medical field and a lot of people in the medical field are numb to death and grieving and have poorly thought out responses regarding death. It doesn't make their comments any less fucked up though. I also returned to work the day after finding out he passed so I was greeted with these comments without taking time to properly grieve.\n \nAnd I'm a woman, living in the US.",
      "user": "Adorable-Painter",
      "depth": 0,
      "score": 10005
    },
    {
      "content": "What the fuck?",
      "user": "Austinpowerstwo",
      "depth": 1,
      "score": 3056
    },
    {
      "content": "This is literally what I just said whispered to myself as I was walking down the stairs into my basement to get the laundry… “what the fuck?”",
      "user": "stanzalaik",
      "depth": 2,
      "score": 236
    },
    {
      "content": "Now that is the definition of toxic person who said that to you",
      "user": "neptu",
      "depth": 1,
      "score": 1456
    },
    {
      "content": "What does the gender of a passing friend have to do with the quantity of grieving that has to be done? I don’t understand what the person meant.",
      "user": "MurphyAteIt",
      "depth": 1,
      "score": 982
    },
    {
      "content": "Some people have it in their heads that men and women can’t *just* be friends, or that they can’t have as strong a bond as same-gender friendships. \n\nI think it stems from a traditionalist view of gender roles being highly separated, like there’s this regressive idea that men and women are so different they’re practically different species, so the only reason they’d want to interact is if they are attracted to each other and they could never have a strong friendship.\n\nWhich is bullshit but it’s surprisingly pervasive in a lot of ways. Usually people aren’t so open about it as OPs example but it’s a view that’s present in a lot more subtle ways all over the place.",
      "user": "coffeeshopAU",
      "depth": 2,
      "score": 419
    },
    {
      "content": "\"I don't understand why you bother renting an apartment. Just buy a house!\" -My Dad, who hadn't purchased a house since 1993.",
      "user": "SugoiBakaMatt",
      "depth": 0,
      "score": 8428
    },
    {
      "content": "My advice to my younger colleagues is to buy a house in the year 2000, like I did. They don't seem to appreciate it. Kids these days...",
      "user": "orrocos",
      "depth": 1,
      "score": 3381
    },
    {
      "content": "I bought my house in 2016 in Western PA before housing prices started skyrocketing here. My house has had a 60% increase in value in those 6 years. If I sold, I'd get more money back than what I paid in mortgage payments the past 6 years.\n\nEven more absurd, per Zillow my house has increased in value $6,500+ in the last 30 days.",
      "user": "Username89054",
      "depth": 2,
      "score": 992
    },
    {
      "content": "If you can't afford gas, buy an electric vehicle.",
      "user": "Gogo726",
      "depth": 0,
      "score": 6670
    },
    {
      "content": "Hahaha this one kills me\n\nLike yeah you know what Jim I can't afford  the $100 of gas I better go buy a $60,000+ electric vehicle.",
      "user": "Relevant-Distance886",
      "depth": 1,
      "score": 2753
    },
    {
      "content": "And if you live in an apartment then the EV industry shits on you because a vast majority of communal living situations have little to no EV charging stations if at all, and if they do have any then they're usually like 5-10 of them way over by the leasing office meant for like a quarter mile's worth of more than a dozen apartment buildings.   \n\n\nIf you own a house, then depending on when it was built you would have to pay money to have a plug in the house changed so that it can charge an EV fast enough to be worth it.",
      "user": "emolr",
      "depth": 2,
      "score": 824
    },
    {
      "content": "It’s expensive being poor.",
      "user": "Chozo-trained",
      "depth": 1,
      "score": 566
    },
    {
      "content": "Buy some $50 boots every year or buy some $150 boots every couple years. A lot of people can only afford the $50 boots so spend more money in the long run than those that can afford the good boots",
      "user": "shewy92",
      "depth": 2,
      "score": 188
    },
    {
      "content": "\"The reason that the rich were so rich, Vimes reasoned, was because they managed to spend less money.\n\nTake boots, for example. He earned thirty-eight dollars a month plus allowances. A really good pair of leather boots cost fifty dollars. But an affordable pair of boots, which were sort of OK for a season or two and then leaked like hell when the cardboard gave out, cost about ten dollars. Those were the kind of boots Vimes always bought, and wore until the soles were so thin that he could tell where he was in Ankh-Morpork on a foggy night by the feel of the cobbles.\n\nBut the thing was that good boots lasted for years and years. A man who could afford fifty dollars had a pair of boots that'd still be keeping his feet dry in ten years' time, while the poor man who could only afford cheap boots would have spent a hundred dollars on boots in the same time and would still have wet feet.\n\nThis was the Captain Samuel Vimes 'Boots' theory of socioeconomic unfairness.\"\n\n-Terry Pratchett",
      "user": "chemwhizzz47",
      "depth": 3,
      "score": 402
    },
    {
      "content": "\"Why don't you live on disability?\" as a response to disabled people complaining about local government cutting back programs designed for making gainful employment accessible.",
      "user": "Voltage_Z",
      "depth": 0,
      "score": 6596
    },
    {
      "content": "I work with disabled adults. This is a bigger problem than most people realize.",
      "user": "RavenNymph90",
      "depth": 1,
      "score": 2480
    },
    {
      "content": "It's a massive issue. Working through just Veterans Affairs to get disability can be a monster. It's disheartening and really does make you want to throw your hands up and just go \"I'll figure it out!\" That said, they are pretty good once it's all said and done and the situation is, at least, livable to me. However, I've tried to help friends that are not Veterans with disability claims and holeeeeee crap it's a swamp out there! Nothing is connected, there's no \"easy access\" and some of the people you run across Ghandi would have slapped.",
      "user": "Mike7676",
      "depth": 2,
      "score": 1083
    },
    {
      "content": "I’ve got clients and know people who need disability in order to pay for meds that make it so they can work and live a normal life. However, if they earn too much at their job, they lose their disability and can no longer pay for medication. If they can’t afford their meds, they can’t work or live a normal life.\n\nIt’s all just so messy and frustrating. It doesn’t feel like helping people at all.",
      "user": "RavenNymph90",
      "depth": 3,
      "score": 667
    },
    {
      "content": "Not to mention if they get married they often lose their disability and the disability Medicaid if they qualified for that. It becomes the responsibility of the spouse to provide for them both if their disability inhibits them from working. It’s a completely fucked system",
      "user": "spacecowboy203",
      "depth": 4,
      "score": 292
    }
  ],
  "exportPath": "C:\\Users\\licav\\Desktop",
  "voice": "ChristopherNeural",
  "outro": "Thank you for watching",
  "music": null
}
