{
  "post": {
    "all_awardings": [
      { "count": 13, "name": "Silver" },
      { "count": 6, "name": "Helpful" },
      { "count": 9, "name": "Wholesome" },
      { "count": 1, "name": "Ally" }
    ],
    "title": "What aging celebrity(40-60) would you still tap?",
    "author": "SmashingBlumpkins777",
    "num_comments": 20751,
    "subreddit": "AskReddit",
    "selftext": "",
    "created_utc": 1648244788,
    "over_18": true,
    "score": 24570
  },
  "comments": [
    [
      {
        "author": "groundsgonesour",
        "body": ["Monica Bellucci"],
        "all_awardings": [
          { "count": 3, "name": "Helpful" },
          { "count": 2, "name": "Wholesome" },
          { "count": 1, "name": "Take My Energy" },
          { "count": 1, "name": "Heartwarming" },
          { "count": 1, "name": "I'll Drink to That" },
          { "count": 1, "name": "Timeless Beauty" }
        ],
        "created_utc": 1648246268,
        "depth": 0,
        "score": 11925,
        "avatar": { "face": 67, "head": 47, "body": 14 },
        "index": 0
      },
      {
        "author": "HappyToBeMoi",
        "body": [
          "Dude…I saw Monica Bellucci live once in Venice while she was recording Mozart in the Jungle.",
          "I lost my mind.",
          "My whole family was having an awkward group boner/meltdown.",
          "Even my mom.",
          "My mom.",
          "She undressed that woman with her eyes and fanned herself like her arm malfunctioned and was flushing hard.",
          "My 4 brothers were blushing ear to ear like idiots and the little one burst himself and ran to a bathroom before my brothers followed him and gingerly came back like 5 minutes later.",
          "My dad put the brave front for all of us.",
          "He was so cool and collected and trying to not act like a dog in front me and mom.",
          "So he just took a fashion magazine I had and was alternating between fanning mom and himself.",
          "We were just walking around when my family and I happened on the set location.",
          "The sex appeal that woman has and unleashes is mind boggling.",
          "Like she’s just so free, unhinged and elegant on top of it.",
          "It was my first time in Venice.",
          "I was having so much fun but I discovered there and there that people definitely add to the magic of life.",
          "She’s so womanly and lush.",
          "As a woman, I feel not enough women fully allow to let their full natures out (for good reason) and she does (she’s got two huge body guards that look like Snorlax though).",
          "To feel so confident and safe to just be beautiful and sexy in the open is so mesmerizing.",
          "Her smile is breathtaking.",
          "In person, she’s eons prettier.",
          "Like the pictures and movies seriously don’t do her justice.",
          "Honestly if I had the luxury/money she does I’d be nothing less than what she is and embodies.",
          "Like a walking fertility god.",
          "She’s like both the woman everyone wants to be when they grow up and the woman we want to bone.",
          "If she had any bisexual inklings, man…some people aren’t worth the hype, but Signorina Bellucci is worth the hype.",
          "She was so nice and actually came to us and greeted us.",
          "We were all blushing like we were going to combust and all we could do was stare at her beautiful cleavage and eyes.",
          "My dad giggled like a little girl and my brothers did the avoidant staring guys do when they’re trying to not sexualize a woman.",
          "Her perfume was so beautiful, like spicy golden honey.",
          "The knowing smile she flashed my mom while my dad was just agape was epic.",
          "I got so mad she didn’t flash me her teeth like that.",
          "My mom’s hella straight but apparently she had second thoughts when she saw Monica and Monica caught it.",
          "Next to the word “woman” should be her picture because honestly she’s got it.",
          "The first time in my life where I sympathized with men and their blue balls as I had an inconceivable urge to have her carry my eggs and I’m a woman.",
          "So did my mom.",
          "I didn’t know how I’d manage to scramble our eggs as I was still “innocent” but then my brain did all the dirty work for me.",
          "I felt like fucking pressure cooker and I thought I was going to die from overheating.",
          "If it was possible to do her brain, I’d do that too.",
          "I want to shuck her like escargot.",
          "The weather was perfectly fine that day but it felt like that time we had a heatwave…We all still reminisce over the infamous family boner.\n\nAdded:",
          "I’m floored by all the love.",
          "Thank you to you all for the support and I’m glad to have made you all happy.",
          "You have all made my week and then some.",
          "Truly, I’m flabbergasted and so grateful."
        ],
        "all_awardings": [
          { "count": 27, "name": "Silver" },
          { "count": 5, "name": "Gold" },
          { "count": 3, "name": "Platinum" },
          { "count": 17, "name": "Helpful" },
          { "count": 13, "name": "Wholesome" },
          { "count": 3, "name": "All-Seeing Upvote" },
          { "count": 5, "name": "Take My Energy" },
          { "count": 1, "name": "Faith In Humanity Restored" },
          { "count": 2, "name": "Bravo!" },
          { "count": 1, "name": "Party Train" },
          { "count": 1, "name": "Vibing" },
          { "count": 1, "name": "Masterpiece" },
          { "count": 2, "name": "To The Stars" },
          { "count": 1, "name": "Glow Up" },
          { "count": 1, "name": "Buff Doge" },
          { "count": 1, "name": "Take My Power" },
          { "count": 1, "name": "Super Heart Eyes" },
          { "count": 1, "name": "You Dropped This" },
          { "count": 1, "name": "Blow a Kiss" }
        ],
        "created_utc": 1648259179,
        "depth": 1,
        "score": 12131,
        "avatar": { "face": 69, "head": 30, "body": 151 },
        "index": 1
      },
      {
        "author": "TH3_Captn",
        "body": ["Can this become new copypasta"],
        "all_awardings": [],
        "created_utc": 1648261128,
        "depth": 2,
        "score": 5911,
        "avatar": { "face": 66, "head": 43, "body": 32 },
        "index": 2
      }
    ]
  ]
}
