{
  "post": {
    "all_awardings": [
      {
        "count": 1,
        "name": "Silver"
      },
      {
        "count": 2,
        "name": "Helpful"
      },
      {
        "count": 3,
        "name": "Wholesome"
      }
    ],
    "id": "tniyud",
    "title": "What's the most out of touch thing you've heard a person say?",
    "author": "LaunchesKayaks",
    "num_comments": 5873,
    "permalink": "/r/AskReddit/comments/tniyud/whats_the_most_out_of_touch_thing_youve_heard_a/",
    "score": 8024,
    "subreddit": "AskReddit",
    "subreddit_name_prefixed": "r/AskReddit",
    "total_awards_received": 6,
    "ups": 8024,
    "selftext": ""
  },
  "comments": [
    [
      {
        "content": "When my  best friend passed unexpectedly, a lot of people said \"well at least it wasn't one of your female friends. That would have been way harder.\" As though I can't have a strong platonic bond with someone of the opposite sex.\n\nEdited to add because people are asking: It may have been a stretch to say \"a lot\" and I own that. I can think of 11 people who said it to me, but I'm saying 6-11 because if you take my coworkers and bosses who said it out of the equation, it was 6 people. I gave my coworkers and bosses the benefit of the doubt as I'm in the medical field and a lot of people in the medical field are numb to death and grieving and have poorly thought out responses regarding death. It doesn't make their comments any less fucked up though. I also returned to work the day after finding out he passed so I was greeted with these comments without taking time to properly grieve.\n \nAnd I'm a woman, living in the US.",
        "user": "Adorable-Painter",
        "depth": 0,
        "score": 10005
      },
      {
        "content": "What the fuck?",
        "user": "Austinpowerstwo",
        "depth": 1,
        "score": 3056
      },
      {
        "content": "This is literally what I just said whispered to myself as I was walking down the stairs into my basement to get the laundry… “what the fuck?”",
        "user": "stanzalaik",
        "depth": 2,
        "score": 236
      }
    ]
  ],
  "video": "/videos/angry.mp4",
  "exportPath": "C:\\Users\\licav\\Desktop",
  "voice": "ChristopherNeural",
  "outro": "Thank you for watching",
  "music": null
}
